# CHAPTER 5
# Data Cleaning and Preparation

During the course of doing data analysis and modeling, a significant amount of time is spent on data preparation: loading, cleaning, transforming, and rearranging. Such tasks are often reported to take up 80% or more of an analyst’s time. Sometimes the way that data is stored in files or databases is not in the right format for a particular task. Many researchers choose to do ad hoc processing of data from one form to another using a general-purpose programming language, like Python, Perl, R, or Java, or Unix text-processing tools like sed or awk. Fortunately, pandas, along with the built-in Python language features, provides you with a high-level, flexible, and fast set of tools to enable you to manipulate data into the right form.

## 5.1 Handling Missing Data

Missing data occurs commonly in many data analysis applications. One of the goals of pandas is to make working with missing data as painless as possible. For example, all of the descriptive statistics on pandas objects exclude missing data by default. 

The way that missing data is represented in pandas objects is somewhat imperfect, but it is functional for a lot of users. For numeric data, pandas uses the floating-point value **NaN** (Not a Number) to represent missing data. We call this a *sentinel value* that can be easily detected:

In [5]:
import pandas as pd
import numpy as np

In [6]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In pandas, we’ve adopted a convention used in the R programming language by referring to missing data as **NA**, which stands for *not available*. In statistics applications, NA data may either be data that does not exist or that exists but was not observed (through problems with data collection, for example). When cleaning up data for analysis, it is often important to do analysis on the missing data itself to identify data collection problems or potential biases in the data caused by missing data. 

The built-in Python None value is also treated as NA in object arrays:

In [8]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

There is work ongoing in the pandas project to improve the internal details of how missing data is handled, but the user API functions, like pandas.isnull, abstract away many of the annoying details. See Table 5-1 for a list of some functions related to missing data handling.

<br>
<center>Table 5.1: NA handling methods</center>
<img src="Table5.1.jpg">

### 5.1.1 Filtering Out Missing Data 

There are a few ways to filter out missing data. While you always have the option to do it by hand using pandas.isnull and boolean indexing, the **dropna** can be helpful. On a Series, it returns the Series with only the non-null data and index values:

In [9]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

This is equivalent to:

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

With DataFrame objects, things are a bit more complex. You may want to drop rows or columns that are all NA or only those containing any NAs. **dropna** by default drops any row containing a missing value:

In [12]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

Passing **how='all'** will only drop rows that are all NA:

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

To drop columns in the same way, pass **axis=1**:

In [15]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [16]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

A related way to filter out DataFrame rows tends to concern time series data. Suppose you want to keep only rows containing a certain number of observations. You can indicate this with the **thresh** argument:

In [17]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.434768       NaN       NaN
1 -0.672066       NaN       NaN
2  0.238355       NaN  2.383814
3 -0.765225       NaN -1.607577
4 -0.020276 -0.075257 -0.815671
5  2.144308 -0.316621 -0.563034
6 -0.678813 -1.364482 -0.410755

In [18]:
df.dropna()

          0         1         2
4 -0.020276 -0.075257 -0.815671
5  2.144308 -0.316621 -0.563034
6 -0.678813 -1.364482 -0.410755

In [19]:
df.dropna(thresh=2)
# it will drop any rows that contain less than 2 observation values

          0         1         2
2  0.238355       NaN  2.383814
3 -0.765225       NaN -1.607577
4 -0.020276 -0.075257 -0.815671
5  2.144308 -0.316621 -0.563034
6 -0.678813 -1.364482 -0.410755

### 5.1.2 Filling In Missing Data 

Rather than filtering out missing data (and potentially discarding other data along with it), you may want to fill in the “holes” in any number of ways. For most purposes, the **fillna** method is the workhorse function to use. Calling **fillna** with a constant replaces missing values with that value:

In [20]:
df.fillna(0)

          0         1         2
0 -0.434768  0.000000  0.000000
1 -0.672066  0.000000  0.000000
2  0.238355  0.000000  2.383814
3 -0.765225  0.000000 -1.607577
4 -0.020276 -0.075257 -0.815671
5  2.144308 -0.316621 -0.563034
6 -0.678813 -1.364482 -0.410755

Calling **fillna** with a dict, you can use a different fill value for each column:

In [21]:
df

          0         1         2
0 -0.434768       NaN       NaN
1 -0.672066       NaN       NaN
2  0.238355       NaN  2.383814
3 -0.765225       NaN -1.607577
4 -0.020276 -0.075257 -0.815671
5  2.144308 -0.316621 -0.563034
6 -0.678813 -1.364482 -0.410755

In [22]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.434768  0.500000  0.000000
1 -0.672066  0.500000  0.000000
2  0.238355  0.500000  2.383814
3 -0.765225  0.500000 -1.607577
4 -0.020276 -0.075257 -0.815671
5  2.144308 -0.316621 -0.563034
6 -0.678813 -1.364482 -0.410755

**fillna** returns a new object, but you can modify the existing object *in-place*:

In [23]:
df.fillna(0, inplace=True)
df

          0         1         2
0 -0.434768  0.000000  0.000000
1 -0.672066  0.000000  0.000000
2  0.238355  0.000000  2.383814
3 -0.765225  0.000000 -1.607577
4 -0.020276 -0.075257 -0.815671
5  2.144308 -0.316621 -0.563034
6 -0.678813 -1.364482 -0.410755

The same interpolation methods available for reindexing can be used with **fillna**:

In [24]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.693788 -0.054053  0.645281
1 -0.949852 -0.232946  0.119398
2 -0.991162       NaN -2.884015
3  0.580824       NaN  0.741954
4 -2.216122       NaN       NaN
5 -0.498152       NaN       NaN

In [25]:
df.fillna(method='ffill')

C:\Users\Izzah Alia\AppData\Local\Temp\ipykernel_1876\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

          0         1         2
0 -0.693788 -0.054053  0.645281
1 -0.949852 -0.232946  0.119398
2 -0.991162 -0.232946 -2.884015
3  0.580824 -0.232946  0.741954
4 -2.216122 -0.232946  0.741954
5 -0.498152 -0.232946  0.741954

In [26]:
 df.fillna(method='ffill', limit=2)

C:\Users\Izzah Alia\AppData\Local\Temp\ipykernel_1876\531624609.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.693788 -0.054053  0.645281
1 -0.949852 -0.232946  0.119398
2 -0.991162 -0.232946 -2.884015
3  0.580824 -0.232946  0.741954
4 -2.216122       NaN  0.741954
5 -0.498152       NaN  0.741954

With **fillna** you can do lots of other things with a little creativity. For example, you might pass the *mean* or *median* value of a Series:

In [27]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [28]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

See Table 5-2 for a reference on **fillna**.

<br>
<center>Table 5.2:  fillna function arguments </center>
<img src="Table5.2.jpg">

In [29]:
https://chrisalbon.com/python/data_wrangling/pandas_missing_data/

SyntaxError: invalid syntax (3545541643.py, line 1)

## 5.2 Data Transformation 

So far in this chapter we’ve been concerned with rearranging data. Filtering, cleaning, and other transformations are another class of important operations. 

### 5.2.1 Removing Duplicates 

Duplicate rows may be found in a DataFrame for any number of reasons. Here is an example:

In [30]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

The DataFrame method **duplicated** returns a boolean Series indicating whether each row is a duplicate (has been observed in a previous row) or not:

In [31]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

Relatedly, **drop_duplicates** returns a DataFrame where the duplicated array is False:

In [32]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

Both of these methods by default consider all of the columns; alternatively, you can specify any subset of them to detect duplicates. Suppose we had an additional column of values and wanted to filter duplicates only based on the 'k1' column:

In [33]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [34]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

**duplicated** and **drop_duplicates** by default keep the first observed value combination. Passing *keep='last'* will return the last one:

In [35]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 5.2.2 Transforming Data Using a Function or Mapping 

For many datasets, you may wish to perform some transformation based on the values in an array, Series, or column in a DataFrame. Consider the following hypothetical data collected about various kinds of vegetables:

In [36]:
data = pd.DataFrame({'vege': ['cabbage', 'carrot', 'cabbage','Lettuce', 'potato', 'Cabbage', 
                             'lettuce', 'tomato', 'cucumber'],  'weight': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

       vege  weight
0   cabbage     4.0
1    carrot     3.0
2   cabbage    12.0
3   Lettuce     6.0
4    potato     7.5
5   Cabbage     8.0
6   lettuce     3.0
7    tomato     5.0
8  cucumber     6.0

Suppose you wanted to add a column indicating the seller that each food came from. Let’s write down a mapping of each distinct vegetables type to the seller:

In [37]:
vege_to_seller = {'cabbage': 'David',  'carrot': 'David',  'lettuce': 'Ahmad',  'potato': 'Ahmad', 
                  'tomato': 'David',  'cucumber': 'Tina'}

The **map** method on a Series accepts a function or dict-like object containing a mapping, but here we have a small problem in that some of the vegetables are capitalized and others are not. Thus, we need to convert each value to lowercase using the **str.lower** Series method:

In [38]:
lowercased = data['vege'].str.lower()
lowercased

0     cabbage
1      carrot
2     cabbage
3     lettuce
4      potato
5     cabbage
6     lettuce
7      tomato
8    cucumber
Name: vege, dtype: object

In [39]:
data['seller'] = lowercased.map(vege_to_seller)
data

       vege  weight seller
0   cabbage     4.0  David
1    carrot     3.0  David
2   cabbage    12.0  David
3   Lettuce     6.0  Ahmad
4    potato     7.5  Ahmad
5   Cabbage     8.0  David
6   lettuce     3.0  Ahmad
7    tomato     5.0  David
8  cucumber     6.0   Tina

We could also have passed a function that does all the work:

In [40]:
data['vege'].map(lambda x: vege_to_seller[x.lower()])

0    David
1    David
2    David
3    Ahmad
4    Ahmad
5    David
6    Ahmad
7    David
8     Tina
Name: vege, dtype: object

Using **map** is a convenient way to perform element-wise transformations and other data cleaning–related operations.

### 5.2.3 Replacing Values 

Filling in missing data with the **fillna** method is a special case of more general value replacement. As you’ve already seen, **map** can be used to modify a subset of values in an object but **replace** provides a simpler and more flexible way to do so. Let’s consider this Series:

In [41]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

The -999 values might be sentinel values for missing data. To replace these with NA values that pandas understands, we can use replace, producing a new Series (unless you pass inplace=True):

In [42]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

If you want to replace multiple values at once, you instead pass a list and then the substitute value:

In [43]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

To use a different replacement for each value, pass a list of substitutes:

In [44]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

The argument passed can also be a dict:

In [45]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

The **data.replace** method is distinct from **data.str.replace**, which performs string substitution element-wise. We look at these string methods on Series later in the chapter.

### 5.2.4 Renaming Axis Indexes 

Like values in a Series, axis labels can be similarly transformed by a function or mapping of some form to produce new, differently labeled objects. You can also modify the axes in-place without creating a new data structure. Here’s a simple example:

In [46]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'], 
                    columns=['one', 'two', 'three', 'four']) 
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

Like a Series, the axis indexes have a **map** method:

In [47]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

You can assign to **index**, modifying the DataFrame in-place:

In [48]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

If you want to create a transformed version of a dataset without modifying the original, a useful method is **rename**:

In [49]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

Notably, **rename** can be used in conjunction with a dict-like object providing new values for a subset of the axis labels:

In [50]:
 data.rename(index={'OHIO': 'INDIANA'},columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

**rename** saves you from the chore of copying the DataFrame manually and assigning to its **index** and **columns** attributes. Should you wish to modify a dataset in-place, pass *inplace=True*:

In [54]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### 5.2.5 Discretization and Binning 

Continuous data is often discretized or otherwise separated into “bins” for analysis. Suppose you have data about a group of people in a study, and you want to group them into discrete age buckets:

In [55]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

Let’s divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older. To do so, you have to use **cut**, a function in pandas:

In [56]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

The object pandas returns is a special **Categorical** object. The output you see describes the bins computed by **pandas.cut**. You can treat it like an array of strings indicating the bin name; internally it contains a **categories** array specifying the distinct category names along with a labeling for the **ages** data in the codes attribute:

In [57]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [58]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [59]:
pd.value_counts(cats)

C:\Users\Izzah Alia\AppData\Local\Temp\ipykernel_1876\2346239419.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

Note that **pd.value_counts(cats)** are the bin counts for the result of **pandas.cut**. 

Consistent with mathematical notation for intervals, a parenthesis means that the side is open, while the square bracket means it is closed (inclusive). You can change which side is closed by passing right=False:

In [60]:
 pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

You can also pass your own bin names by passing a list or array to the **labels** option:

In [61]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

If you pass an integer number of bins to **cut** instead of explicit bin edges, it will compute equal-length bins based on the minimum and maximum values in the data. Consider the case of some uniformly distributed data chopped into fourths:

In [62]:
data = np.random.rand(20)
data

array([0.2751211 , 0.31068762, 0.02120308, 0.79336946, 0.8180004 ,
       0.08238861, 0.19212681, 0.79406326, 0.14887576, 0.15752412,
       0.63034065, 0.52209567, 0.53126922, 0.48526594, 0.79073581,
       0.00117599, 0.71565719, 0.1398577 , 0.40605609, 0.4033652 ])

In [63]:
pd.cut(data, 4, precision=2)

[(0.21, 0.41], (0.21, 0.41], (0.00036, 0.21], (0.61, 0.82], (0.61, 0.82], ..., (0.00036, 0.21], (0.61, 0.82], (0.00036, 0.21], (0.21, 0.41], (0.21, 0.41]]
Length: 20
Categories (4, interval[float64, right]): [(0.00036, 0.21] < (0.21, 0.41] < (0.41, 0.61] < (0.61, 0.82]]

The *precision=2* option limits the decimal precision to two digits. 

A closely related function, **qcut**, bins the data based on sample quantiles. Depending on the distribution of the data, using **cut** will not usually result in each bin having the same number of data points. Since **qcut** uses sample quantiles instead, by definition you will obtain roughly equal-size bins:

In [64]:
data = np.random.randn(1000)  # Normally distributed
data

array([-1.00451553e+00,  1.34161675e+00, -1.09673058e+00, -3.04316540e-01,
       -5.79181873e-01, -2.51359217e-01, -4.39946996e-01,  1.05361321e-02,
        1.92675623e-01, -1.01958367e-01, -5.00919562e-01,  2.56592952e-01,
       -6.85621659e-01,  5.63587345e-01,  2.61991923e-01,  1.03164982e+00,
       -1.10916343e+00,  7.78224264e-01,  1.46055539e-01, -6.84716196e-01,
        3.77734152e-01, -8.59828328e-01,  9.81543367e-01, -4.60642903e-01,
        3.03300274e-01,  7.48125839e-02, -8.04340292e-01,  6.09378294e-01,
        3.77433153e-01,  2.60849061e-01, -5.38070066e-01,  1.01714596e+00,
       -7.12274350e-01,  1.72119184e+00,  2.59559035e-01, -6.33687602e-01,
       -1.53642848e-01,  6.34772685e-01, -5.67581907e-01,  4.13832294e-01,
        5.00027411e-01,  1.07796648e+00, -1.54765363e+00,  2.14584061e+00,
       -1.31304499e+00, -6.98601605e-01,  1.19393620e+00,  9.30673755e-01,
        2.66122238e+00, -1.76311521e-01, -1.78139958e+00,  1.26902701e-01,
       -1.12692120e+00, -7.79526177e-01,  6.58108553e-01, -4.95348271e-01,
        3.51005523e-01,  5.69993457e-01, -2.36469118e-01, -3.80097791e-01,
        2.44875767e-02,  7.00078086e-01, -7.33235577e-01,  6.46457530e-01,
        4.65865464e-01, -8.02149401e-01,  1.73965665e+00, -1.19954334e-01,
       -1.17170660e-01,  6.57685577e-01,  1.36993493e+00, -3.29703510e-01,
       -1.05293085e+00, -7.47333936e-01,  2.40640225e-02, -1.71723103e+00,
        3.88742838e-01, -8.57402737e-01, -5.83594755e-01,  7.66477243e-01,
        1.21160319e+00,  1.28267524e+00, -2.68156199e-01, -2.37831726e+00,
        1.27871744e+00,  1.45074680e+00, -1.63351024e-01, -1.87695245e+00,
       -2.14771897e+00, -2.41057498e-01, -9.43982762e-01,  1.17980815e+00,
        8.69171976e-01,  3.41708153e-01,  8.99661061e-01, -1.16577192e+00,
        1.21926788e+00,  1.75355001e+00, -3.49979722e-01, -1.35110530e+00,
       -1.50911575e-01, -1.06426070e+00, -2.34230996e-01, -1.88881187e+00,
       -2.50708454e-01, -2.29308962e-01,  1.12803191e+00, -1.25181479e+00,
        5.01514646e-01,  1.03717238e+00, -1.10342210e+00, -2.19146707e-01,
       -6.06739202e-01, -7.93585725e-01, -1.01960156e-01,  2.16100918e-01,
        9.94550662e-01, -4.15074600e-01, -1.43913716e+00,  2.21735256e+00,
       -1.77252711e+00,  2.07958378e+00, -1.19158976e+00, -5.79590329e-01,
        7.54124336e-01, -4.41972307e-02, -3.82977620e-01,  3.94460119e-01,
        3.52207367e-01, -1.06949853e-01, -3.89674351e-01,  1.22982970e-01,
        1.27195810e-01, -8.91215512e-01, -1.32009520e-01,  3.81606855e-01,
       -1.20920643e+00,  1.88388668e-01,  1.16062784e+00,  8.21231695e-01,
        1.06546662e+00,  1.04134707e+00, -1.54794204e-01,  2.37866475e-01,
       -6.74026518e-01,  7.68563818e-01, -1.73011899e-01,  3.04311806e-01,
       -7.35077183e-01,  3.23711741e-02,  3.65281622e-01, -3.01024590e-02,
       -7.84984848e-01, -1.67979219e-01,  1.23675403e+00, -8.87060875e-01,
       -2.73871331e-01,  2.74745153e-01,  1.25858570e+00,  3.86320149e-01,
        5.82684265e-01,  4.20259699e-01, -1.47258189e+00, -1.54768358e+00,
       -1.17240104e-01, -4.98145469e-01, -9.07797552e-01, -1.17355515e+00,
       -6.20202789e-01, -1.05676063e+00, -1.28927935e+00, -7.90064176e-01,
       -1.06687984e+00, -4.92301720e-03,  1.21477264e+00, -5.39785637e-01,
       -4.55565103e-01, -4.94761861e-01,  1.57212220e+00,  3.39404101e-01,
       -5.46164200e-01, -1.22126132e+00, -3.58094870e-01, -1.02788554e+00,
       -4.70835275e-01,  3.97502221e-01,  1.43422348e+00, -5.69681091e-01,
        1.84006072e-01,  1.08176798e-01,  6.74155759e-01, -1.67230172e+00,
       -1.82448238e+00,  7.48663035e-02, -1.04646097e-01, -1.10481398e+00,
       -1.08800178e+00,  7.36159808e-01,  7.71717618e-01, -9.29686146e-01,
        9.50593771e-01,  3.23442900e-01,  1.05149585e+00, -1.59316811e+00,
       -3.57110649e-01, -1.00117662e+00,  3.35396499e-02,  9.37083148e-02,
        1.09641957e+00, -2.02122667e+00, -3.78911419e-01,  7.25833104e-01,
       -1.54687910e+00, -7.11500537e-01,  1.38865459e+00,  8.96156555e-01,
       -2.38465678e-01, -1.30585813e-01, -2.87448240e-01,  1.01339813e+00,
       -5.89535377e-01, -9.25985811e-01,  6.41585408e-01,  2.00835613e-01,
        5.92697789e-01, -1.99293410e-01,  4.86863381e-01,  4.95718922e-01,
       -6.59329998e-01,  7.34091387e-01,  8.77975926e-01, -5.08382276e-02,
        4.21049786e-01, -6.71019241e-01, -6.27304140e-01,  1.26799894e+00,
       -2.38053246e-01,  6.13819921e-01, -5.81042636e-01,  3.57449541e-01,
        9.84087457e-01, -9.24257838e-01,  9.99880197e-01,  1.47051309e+00,
        6.26192704e-01,  7.75988665e-01,  6.13237399e-01, -1.17897573e+00,
       -2.63411126e-01, -3.78328739e-02, -1.21363097e+00,  7.04430341e-01,
        9.03282213e-01,  4.05886017e-01,  5.93830617e-01, -1.86602436e+00,
       -3.11510547e-02, -2.41010892e-01, -2.61068309e-01, -1.03295885e+00,
       -8.51554964e-01,  2.20051469e-02,  7.64100434e-01, -3.33137240e-01,
        4.49769540e-02,  1.26589092e-02, -7.89731697e-01, -3.59222256e-02,
       -1.02688736e-02, -2.26681538e-01,  3.82548958e-01,  1.43911883e+00,
        7.07402615e-01, -6.00956283e-01,  8.36653688e-01,  1.43105061e+00,
       -8.73962200e-01, -7.80103687e-01,  5.73033097e-01,  3.63829639e-01,
        1.23794602e+00,  1.44150555e+00,  1.75800631e+00, -3.75306022e-01,
       -8.95076926e-01,  6.10333970e-01,  7.73336062e-01,  2.91981562e-02,
        5.82561085e-01,  1.48757150e+00, -3.82024760e-01,  8.24159804e-01,
        1.86779865e-01,  2.07405973e+00,  1.45415374e+00, -2.14789823e+00,
        1.84151179e+00, -2.11248971e-01,  4.91618659e-01, -8.43618039e-01,
        7.97264265e-01, -3.08270916e-01, -4.82075543e-01,  6.84061977e-01,
        8.39818888e-01, -1.15557180e+00,  4.35264948e-01,  4.98663884e-01,
        2.17383579e-01,  2.12799215e-01,  3.44344482e-01,  1.67141708e+00,
       -1.22493267e+00, -3.56910709e-01, -5.45658212e-01,  8.48593954e-01,
        2.57687578e-01, -3.75379675e-01, -7.56294873e-01, -9.71630640e-01,
       -1.25510823e+00, -8.77861723e-01,  7.36321908e-01,  7.97214335e-01,
       -3.72093022e-01,  1.49657538e+00, -1.42709189e+00,  4.52761191e-01,
       -1.17778971e+00, -6.10562042e-01, -1.06307509e+00,  1.79578050e-01,
       -1.07279442e+00,  5.85036138e-01,  8.21402107e-01, -1.75748733e+00,
        7.21469880e-01, -9.29516137e-02,  2.00269578e+00,  1.42747402e+00,
        6.09391730e-01,  9.13963249e-02,  6.46844821e-02, -6.63899070e-01,
       -5.29193192e-02, -5.57768981e-02, -2.84133749e-01,  1.52231944e+00,
       -1.07423591e+00, -2.02930845e-01,  2.14748857e+00,  1.66673145e-01,
       -6.34215522e-01,  8.69346767e-01, -1.21872369e+00,  2.68122747e-01,
        3.17874543e-01,  2.63200526e-01, -2.01282988e-01, -4.32995079e-01,
       -5.44896360e-02, -1.54066715e-01, -4.81281178e-01, -7.09115770e-01,
       -3.40881422e-01, -6.26546921e-01,  9.58545861e-01,  2.75081294e-01,
        3.75674795e-01, -1.30491078e+00, -1.04004363e+00,  2.84577161e+00,
        2.05868818e-03,  3.39963894e-01,  3.15901157e-01,  3.28920800e-01,
       -4.01757324e-01, -5.02641642e-01, -7.11505091e-01,  6.00083578e-01,
        1.02540151e+00, -4.47148114e-01, -1.13298813e+00,  1.31871062e+00,
       -8.58133785e-01, -1.06845826e+00,  1.30958522e+00, -5.43641836e-01,
        6.59389528e-01, -1.36695146e+00,  9.50694121e-02,  1.26366095e-01,
       -1.12619281e+00,  2.83403935e-01, -1.44093387e-01, -2.40333411e+00,
       -5.54294357e-01, -8.13254611e-01, -3.06971084e-01, -7.25842789e-01,
        1.41071294e-01,  8.50497964e-02,  3.89417911e-01,  9.46744404e-01,
        2.60501103e-01, -4.07561836e-01, -3.59126273e-01, -6.73632270e-01,
        4.14033031e-01,  1.38587924e-01, -4.68884292e-01,  3.46561763e-02,
        2.09029828e-01, -1.35584742e+00,  1.61567483e+00,  2.82708219e-01,
       -2.49410378e+00, -1.76499221e+00, -2.36706984e-01, -8.03615257e-02,
        1.63817519e-03, -1.59123147e+00, -3.95200132e-02, -2.16935167e-01,
        1.47386675e+00,  3.52750816e-01,  1.25413850e+00, -1.57588666e-01,
       -5.15820558e-01, -5.01558971e-01, -5.86862162e-01,  2.01720411e-01,
        1.30940652e+00, -8.39077915e-01, -1.86719059e-01,  4.57467361e-01,
       -1.70685267e-01, -1.02285231e+00,  4.40444597e-01, -7.81992878e-01,
        1.33004229e-01,  8.99336181e-01,  3.33118798e-01,  9.27514768e-01,
        1.01584605e+00, -3.48059697e-01,  7.31055912e-01,  1.17648078e+00,
       -5.65554810e-01,  1.33589429e-01,  1.28581446e+00,  1.06031145e+00,
       -1.76626134e+00, -3.77832379e-01,  1.29584044e+00,  3.15500277e-01,
       -2.47798544e+00, -4.21827549e-01, -9.90422617e-01, -1.09445619e+00,
        4.54282737e-01,  4.08433283e-01, -9.92446525e-01,  1.16722816e+00,
       -1.43193146e+00, -9.61717923e-01, -4.67757741e-01,  1.01758539e+00,
       -6.14710847e-01, -1.17801448e+00, -9.24213156e-01, -1.30071819e+00,
       -1.10985982e+00, -1.01278418e+00,  2.54137220e-01,  5.37971244e-01,
        1.86481822e+00, -8.26350268e-03,  3.51580609e-02,  1.45291647e-01,
       -1.25231668e+00, -8.45193546e-01, -8.77240901e-01,  6.66719425e-01,
       -7.00858537e-01, -1.30133662e-02,  4.24168311e-02, -5.09969934e-01,
        3.57551665e-01, -2.36718021e-01,  3.79645272e-01, -5.19511112e-01,
       -1.20194541e+00, -2.03120739e-01, -3.54834900e-01, -2.46867152e+00,
        1.95101734e+00,  1.60022217e+00, -6.80538912e-01,  6.50352796e-01,
        1.90192467e+00,  9.00152598e-01,  1.84374763e+00, -3.68456783e-01,
       -1.18832902e+00,  3.41604898e-01, -4.21114663e-01,  1.74162451e+00,
       -3.30895232e-01, -1.99851109e+00,  1.19439171e+00, -1.08361940e+00,
        1.01870765e+00, -9.14334117e-01, -5.81755416e-01, -2.29247813e-01,
       -1.94726695e+00,  6.50759177e-01,  8.41922597e-01,  7.11915269e-01,
        4.00307582e-01,  1.39573131e-01, -1.36166935e+00,  1.33714115e+00,
       -1.22328105e+00, -2.61151043e-01, -7.72029025e-01,  1.64707775e+00,
       -9.35032850e-01,  4.22374411e-01, -1.41745518e-01,  1.01966230e+00,
        4.96693500e-01,  1.10568640e-04,  8.58914447e-01, -4.84287312e-01,
        3.91985489e-01, -7.63075408e-01, -1.06210045e+00, -3.56934641e-01,
       -3.87031422e-01,  4.38536689e-02, -4.12137409e-01, -9.38723874e-01,
       -3.09495325e-02,  4.71605708e-01, -8.86008372e-01,  1.34040313e-01,
        1.43068180e+00, -5.48159232e-02,  1.26979262e+00, -1.34366558e-01,
       -7.66379303e-01, -2.78240549e-01, -1.70537377e-01,  1.88469155e+00,
       -1.40516070e-02, -1.61021528e-01, -2.72901485e-01,  1.10230342e+00,
       -5.32834341e-02, -6.27204152e-01,  4.53511051e-02,  3.81401942e-01,
        3.04004948e-01, -6.98683900e-02, -7.34679166e-01, -7.37990193e-01,
        1.25479751e-01,  1.49095350e-01, -3.12011102e-01,  9.74058598e-02,
       -1.70703046e+00,  2.00543795e+00,  3.70073356e-01, -8.24603259e-02,
       -4.05062501e-01,  1.09898603e+00, -9.53252216e-03, -2.66992310e-01,
       -9.74764990e-01, -1.96143343e-01,  9.08525373e-01,  4.62273008e-01,
        1.05622538e+00,  2.68620921e-01,  1.37634850e+00,  3.66523324e-01,
        1.09049137e+00,  5.81972607e-01, -2.71446166e-01, -8.99139900e-01,
       -2.26675288e-01, -8.02789168e-02,  3.30030754e-01,  1.38219376e+00,
       -1.25093927e+00,  1.14698261e+00,  5.80429453e-01, -7.48911421e-01,
        8.34922517e-01, -1.09502339e+00,  6.13159279e-01, -1.22123960e+00,
       -1.36512513e+00,  5.69902539e-01,  5.75334347e-01,  1.85010617e-01,
       -8.27333897e-01, -1.00102672e+00, -1.31419236e-01,  3.73276826e-01,
       -1.38246401e+00, -7.81187688e-01, -7.91103361e-01,  6.13373227e-01,
        1.96573089e-01, -1.33522134e-01, -2.31682425e+00,  1.96997942e+00,
        4.57357987e-01,  6.58197497e-02,  3.51899585e-01, -1.48061017e-01,
        1.53591068e+00, -9.37280665e-01, -9.59183469e-02,  5.03433064e-01,
       -2.51669027e-01,  1.27561601e+00,  2.27408507e-02, -3.30783841e-01,
       -2.00728581e+00, -1.55975435e+00,  2.13994615e+00,  1.20036555e+00,
       -1.70016427e-01, -4.80924309e-01,  8.21863171e-01,  6.77988965e-01,
        8.80605316e-01,  4.55840794e-01, -1.00071973e+00, -1.41747729e+00,
        2.34680970e+00,  3.67709062e-01, -1.30218116e+00,  7.49513453e-01,
       -2.28196935e-01,  2.17569484e-01,  1.28016921e+00,  1.97198311e-01,
        1.28895359e+00,  3.40541474e-02, -1.14214473e+00,  6.36582271e-01,
        1.84422869e-01,  7.12305039e-01,  5.07483438e-01,  1.46248096e+00,
       -4.40259174e-01,  4.27040851e-01,  3.39986086e-01, -1.05709672e+00,
        4.96960599e-01,  1.06344504e+00, -1.79918884e+00,  7.61648774e-01,
       -7.17609449e-02, -1.76548964e+00,  1.66509721e+00, -1.46099764e+00,
        1.86738694e+00,  5.28090972e-01,  1.39589928e+00, -2.35174113e-01,
        9.66363274e-01,  1.47499557e+00,  4.24146673e-01,  2.27195277e+00,
        1.57684225e+00, -5.27553995e-01, -2.65692687e-03, -7.28230183e-01,
        1.75084934e-02,  1.56616064e+00,  2.00211357e-01,  4.58091368e-01,
       -8.39656950e-01, -2.30386474e-01, -9.08523610e-01,  2.14786202e-02,
       -7.56637834e-01,  1.11975722e+00,  8.42059748e-01, -1.29095044e+00,
        1.97491932e+00, -1.37049810e+00, -2.27087044e+00,  1.55188161e+00,
       -2.35956826e+00,  1.57387465e+00,  5.84665511e-01,  1.09258307e+00,
       -3.54278348e-01,  3.10966123e-01,  2.84069143e-01,  1.81853234e-01,
       -6.41888422e-01,  6.22424806e-01,  1.88138684e+00, -1.33506499e+00,
        1.55638082e+00,  1.52988494e+00,  2.22783511e-01, -1.97388344e-01,
       -2.76813637e-01,  1.93936367e-01, -1.08583595e+00,  1.08870958e+00,
        2.51185361e-01, -3.36815497e-02,  8.25138855e-01, -5.93475427e-01,
        8.90524585e-01, -7.77524058e-01,  2.50095967e+00,  1.15855860e+00,
       -6.11645424e-01, -1.73804314e+00, -2.21982458e-01, -4.49334540e-01,
       -1.19971953e+00,  1.09338134e+00, -1.19518088e+00,  5.89460649e-01,
        1.02484356e+00, -1.66696468e+00, -1.98794323e-01,  4.88456999e-01,
        1.94232323e-01,  1.33493336e+00, -2.00140486e+00, -7.03632617e-01,
        1.26882793e-01,  1.03080480e+00,  1.28233023e+00, -1.67016719e-01,
       -3.80847651e-01,  7.79499941e-02, -6.65922767e-01, -1.58149074e-01,
        4.75703003e-01,  4.91381622e-01, -9.90051757e-01,  1.35844167e-01,
       -1.18893046e+00, -9.88819203e-01, -3.58322344e-01, -1.10213386e+00,
       -1.28809823e+00, -1.13024418e+00,  9.31892494e-01, -1.25697355e+00,
        1.88932482e-01, -7.31411811e-01, -1.08137133e-01, -3.28052934e-02,
       -1.57160561e+00,  2.09749339e+00, -5.20815598e-01,  3.83691524e-01,
       -2.70881007e-01,  2.31267527e+00,  1.28110167e+00, -6.11100246e-01,
        4.66870987e-01, -1.25643070e-02, -1.41955076e-01, -1.04381827e+00,
        3.23905626e-01,  3.87725736e-01,  4.91259756e-01, -1.13728106e+00,
        9.42532121e-01,  2.13788528e-01,  3.28961440e-02, -1.28202026e+00,
       -9.78334909e-01,  7.01277694e-01,  3.66314321e-01,  4.37495218e-01,
        1.11614143e+00, -1.55629264e-02, -3.81578861e-01, -6.80992708e-01,
       -7.64791608e-01,  2.46378137e-01,  1.68223410e+00, -8.09327572e-01,
       -1.26901801e+00,  1.57257776e+00, -1.14482534e+00,  3.70211230e-01,
       -1.10345754e+00,  1.36919320e+00,  1.95464922e+00,  9.28917438e-01,
       -1.94517645e+00,  1.27223972e+00, -2.10748327e+00,  1.13157959e+00,
       -2.42300050e-01, -1.09656848e+00, -2.16077879e-01, -6.03692134e-01,
        1.49167835e+00, -9.52903930e-01,  3.58864659e-01, -7.17935222e-01,
       -5.94768360e-01,  1.85633511e+00,  1.39637226e+00, -4.12825297e-01,
        5.00837106e-01, -5.31365741e-01, -1.20260533e+00,  1.07674985e+00,
       -8.06433956e-01,  1.39582109e+00,  1.60730587e+00, -2.82050533e-02,
        1.55136831e+00,  9.47151486e-02, -1.20074195e-01, -1.29033095e+00,
        1.48068935e+00, -1.70942083e-01, -8.01150105e-01,  3.55145443e-01,
        1.55823996e-01, -1.14911867e+00, -6.91212474e-01,  4.49356289e-02,
       -5.89711998e-01, -2.53244218e-02, -1.16366535e+00, -7.60601187e-01,
        1.59200719e+00,  1.52712447e+00, -7.82009071e-03, -9.52586534e-02,
        1.69902862e+00,  1.61586621e-01,  1.33601520e+00,  8.67491756e-01,
        2.56708284e-01,  4.67130757e-01, -4.89885683e-01, -2.89450655e+00,
        1.70780129e+00, -1.15819011e+00, -3.70655142e-02, -1.81942745e+00,
       -6.84439521e-01, -3.13177436e-02,  1.02437319e-01,  2.73466665e-01,
       -1.80819479e+00,  2.47294845e-01,  1.03311369e+00, -1.64811142e+00,
       -7.81332827e-01, -1.04517650e+00,  1.34988342e+00, -9.14329225e-01,
       -1.82162284e-01, -1.01456999e-01, -6.79943892e-01, -2.34569347e+00,
        1.10107875e+00,  1.98442929e+00,  8.09611146e-01, -1.77134262e+00,
       -3.32685827e-02, -4.73679050e-01,  1.18557448e+00, -1.24325413e-01,
       -1.30698560e+00,  8.63342184e-01,  8.56876979e-01,  9.45443860e-01,
       -4.76534549e-01,  4.27809448e-01, -1.58802533e+00, -3.04361540e-01,
       -6.29876144e-01,  2.20958135e+00, -1.16525343e+00,  1.04775150e+00,
       -2.29521869e+00,  4.02335576e-02, -6.46014388e-02,  1.46319634e+00,
        4.25440974e-01,  1.62708318e+00,  6.32287999e-01, -6.24724287e-01,
       -4.61619262e-01,  1.31641467e+00,  3.99466119e-01,  1.20543575e+00,
       -5.85114070e-01, -7.33900088e-01, -6.62724152e-01,  4.08584783e-01,
        9.64968552e-02, -9.72950061e-01, -2.72237255e+00,  1.06990052e+00,
       -2.45005642e+00,  9.13977586e-01, -4.91525133e-01, -7.06204594e-02,
       -7.20372607e-01, -1.32767115e+00, -3.05210799e-03, -5.03296729e-01,
        1.22700251e+00,  6.12831030e-01, -1.06572212e+00,  1.46715717e+00,
       -1.19464804e+00, -1.51606013e+00,  1.32083789e+00,  8.63624115e-01,
        6.07176208e-01, -9.38535264e-01,  6.18328324e-01,  5.31118648e-01,
       -1.25048082e-01,  4.10249103e-01, -3.60739469e-01,  1.17111881e+00,
       -1.09414159e+00,  2.42240357e-01,  1.07340863e+00,  2.56699580e+00,
        7.25998577e-02, -1.14860176e+00, -3.24899055e-01, -1.11537190e+00,
       -1.49459494e-01,  7.65630967e-01,  1.05469060e-02,  7.36721772e-01,
       -1.29866112e+00, -1.55272767e-01, -3.28424787e-01, -3.15626175e-01,
        8.88607797e-01,  1.13359046e+00,  5.33267271e-01, -3.39317976e-01,
       -5.40657049e-01, -6.73233392e-01, -7.23534566e-01,  6.82228038e-01,
        3.20096538e-01, -8.50479720e-01,  6.84034138e-01,  4.84664874e-02,
        3.51715824e-01, -7.54382883e-01,  3.22203091e-01, -7.45086656e-01,
       -1.43845971e+00,  6.36725059e-01, -8.59572450e-01,  2.29906348e-01,
        5.86531303e-01,  2.14588843e-01,  9.86422762e-01, -4.37348203e-01,
       -1.61427891e+00, -1.13250729e+00, -8.75036196e-03,  1.83401717e+00,
        9.03965961e-01,  1.09204322e+00,  1.34917383e+00, -9.28694422e-01,
        3.30276763e-01, -1.76815005e+00,  1.01122502e+00,  1.39926005e-01,
        3.90260521e-02,  1.66612720e+00, -4.36112643e-01, -7.40881008e-01])

In [65]:
cats = pd.qcut(data, 4)  # Cut into quartiles
cats

[(-2.896, -0.685], (0.647, 2.846], (-2.896, -0.685], (-0.685, -0.00914], (-0.685, -0.00914], ..., (-0.00914, 0.647], (-0.00914, 0.647], (0.647, 2.846], (-0.685, -0.00914], (-2.896, -0.685]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.896, -0.685] < (-0.685, -0.00914] < (-0.00914, 0.647] < (0.647, 2.846]]

In [71]:
pd.value_counts(cats)

C:\Users\Izzah Alia\AppData\Local\Temp\ipykernel_1876\2346239419.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(-2.896, -0.685]      250
(-0.685, -0.00914]    250
(-0.00914, 0.647]     250
(0.647, 2.846]        250
Name: count, dtype: int64

Similar to **cut** you can pass your own quantiles (numbers between 0 and 1, inclusive):

In [72]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.188, -0.00914], (1.283, 2.846], (-1.188, -0.00914], (-1.188, -0.00914], (-1.188, -0.00914], ..., (-0.00914, 1.283], (-0.00914, 1.283], (1.283, 2.846], (-1.188, -0.00914], (-1.188, -0.00914]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.896, -1.188] < (-1.188, -0.00914] < (-0.00914, 1.283] < (1.283, 2.846]]

## 5.3  String Manipulation 

Python has long been a popular raw data manipulation language in part due to its ease of use for string and text processing. Most text operations are made simple with the string object’s built-in methods. For more complex pattern matching and text manipulations, regular expressions may be needed. pandas adds to the mix by enabling you to apply string and regular expressions concisely on whole arrays of data, additionally handling the annoyance of missing data. 


### 5.3.1 String Object Methods 

In many string munging and scripting applications, built-in string methods are sufficient. As an example, a comma-separated string can be broken into pieces with **split**:

In [74]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

**split** is often combined with **strip** to trim whitespace (including line breaks):

In [75]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

These substrings could be concatenated together with a two-colon delimiter using addition:

In [76]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

But this isn’t a practical generic method. A faster and more Pythonic way is to pass a list or tuple to the **join** method on the string '::':

In [77]:
'::'.join(pieces)

'a::b::guido'

Other methods are concerned with locating substrings. Using Python’s **in** keyword is the best way to detect a substring, though **index** and **find* can also be used:

In [78]:
'guido' in val

True

In [79]:
val.index(',')

1

In [80]:
val.find(':')

-1

Note the difference between **find** and **index** is that index raises an exception if the string isn’t found (versus returning –1):

In [81]:
val.index(':')

ValueError: substring not found

Relatedly, **count** returns the number of occurrences of a particular substring:

In [82]:
val.count(',')

2

**replace** will substitute occurrences of one pattern for another. It is commonly used to delete patterns, too, by passing an empty string:

In [83]:
val.replace(',', '::')

'a::b::  guido'

In [84]:
val.replace(',', '')

'ab  guido'

See Table 5-3 for a listing of some of Python’s string methods. Regular expressions can also be used with many of these operations, as you’ll see.

<br>
<center>Table 5.3: Python built-in string methods</center>
<img src="Table5.3.jpg">

### 5.3.2  Regular Expressions 

*Regular expressions* provide a flexible way to search or match (often more complex) string patterns in text. A single expression, commonly called a *regex*, is a string formed according to the regular expression language. Python’s built-in **re** module is responsible for applying regular expressions to strings.

The **re** module functions fall into three categories: pattern matching, substitution, and splitting. Naturally these are all related; a *regex* describes a pattern to locate in the text, which can then be used for many purposes. Let’s look at a simple example:

Suppose we wanted to split a string with a variable number of whitespace characters (tabs, spaces, and newlines). The *regex* describing one or more whitespace characters is **\s+**:

In [86]:
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

<>:3: SyntaxWarning: invalid escape sequence '\s'
<>:3: SyntaxWarning: invalid escape sequence '\s'
C:\Users\Izzah Alia\AppData\Local\Temp\ipykernel_1876\2948975259.py:3: SyntaxWarning: invalid escape sequence '\s'
  re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

When you call **re.split('\s+', text)**, the regular expression is first compiled, and then its split method is called on the passed text. You can compile the *regex* yourself with **re.compile**, forming a reusable *regex* object:

In [87]:
regex = re.compile('\s+')
regex.split(text)

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\Izzah Alia\AppData\Local\Temp\ipykernel_1876\2791392083.py:1: SyntaxWarning: invalid escape sequence '\s'
  regex = re.compile('\s+')

['foo', 'bar', 'baz', 'qux']

If, instead, you wanted to get a list of all patterns matching the *regex*, you can use the **findall** method:

In [88]:
regex.findall(text)

['    ', '\t ', '  \t']

**match** and **search** are closely related to **findall**. While **findall** returns all matches in a string, **search** returns only the first match. More rigidly, **match** only matches at the beginning of the string. As a less trivial example, let’s consider a block of text and a regular expression capable of identifying most email addresses:

In [89]:
text = """Dave dave@google.com 
Steve steve@gmail.com 
Rob rob@gmail.com 
Ryan ryan@yahoo.com 
""" 
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

#re.IGNORECASE makes the regex case-insensitive 
regex = re.compile(pattern, flags=re.IGNORECASE)

Using **findall** on the text produces a list of the email addresses:

In [90]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

**search** returns a special match object for the first email address in the text. For the preceding *regex*, the match object can only tell us the start and end position of the pattern in the string:

In [91]:
m = regex.search(text)
m

In [92]:
text[m.start():m.end()]

'dave@google.com'

**regex.match** returns None, as it only will match if the pattern occurs at the start of the string:

In [93]:
print(regex.match(text))

None

Relatedly, **sub** will return a new string with occurrences of the pattern replaced by the a new string:

In [94]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

Suppose you wanted to find email addresses and simultaneously segment each address into its three components: username, domain name, and domain suffix. To do this, put parentheses around the parts of the pattern to segment:

In [95]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

A match object produced by this modified *regex* returns a tuple of the pattern components with its **groups** method:

In [96]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

**findall** returns a list of tuples when the pattern has groups:

In [97]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

**sub** also has access to groups in each match using special symbols like \1 and \2. The symbol \1 corresponds to the first matched group, \2 corresponds to the second, and so forth:

In [98]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

There is much more to regular expressions in Python, most of which is outside our scope. Table 5-4 provides a brief summary.

<br>
<center>Table 5.4: Regular expression methods</center>
<img src="Table5.4.jpg">

### 5.3.3 Vectorized String Functions in pandas 

Cleaning up a messy dataset for analysis often requires a lot of string munging and regularization. To complicate matters, a column containing strings will sometimes have missing data:

In [99]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [100]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

String and regular expression methods can be applied (passing a **lambda** or other function) to each value using **data.map**, but it will fail on the NA (null) values. To cope with this, Series has array-oriented methods for string operations that skip NA values. These are accessed through Series’s **str** attribute; for example, we could check whether each email address has 'gmail' in it with **str.contains**:

In [101]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

Regular expressions can be used, too, along with any **re** options like **IGNORECASE**:

In [102]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [103]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

There are a couple of ways to do vectorized element retrieval. Either use **str.get** or index into the **str** attribute:

In [104]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

To access elements in the embedded lists, we can pass an index to either of these functions:

In [105]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [ ]:
matches.str[0]

You can similarly slice strings using this syntax:

In [ ]:
data.str[:5]

See Table 5-5 for more pandas string methods.

<br>
<center>Table 5.5: Partial listing of vectorized string methods</center>
<img src="Table5.5.jpg">